[
  {
    "bookId": "1",
    "bookName": "The Dating Playbook for Men",
    "author": "Andrew Ferebee",
    "image": "https://i.ibb.co/3WKLnnR/Book1.png",
    "review": "A practical guide for men navigating the complexities of dating in the modern world. Ferebee's insights are invaluable for those seeking to enhance their romantic lives. With actionable advice and relatable anecdotes, this book equips readers with the tools to build confidence and form meaningful connections. Whether you're new to dating or looking to improve your approach, 'The Dating Playbook for Men' offers practical strategies for success.",
    "totalPages": 240,
    "rating": 4.5,
    "category": "Self-Help",
    "tags": ["Relationships", "Self-Improvement"],
    "publisher": "New Era Publishing",
    "yearOfPublishing": 2019
  },
  {
    "bookId": "2",
    "bookName": "Why Do You Hate Money?",
    "author": "Jean-Nicholas Hould",
    "image": "https://i.ibb.co/QmsjpgP/Book2.png",
    "review": "An eye-opening exploration of people's attitudes towards wealth and financial success. Hould challenges conventional thinking and encourages readers to examine their relationship with money. Through compelling anecdotes and practical advice, this book offers a fresh perspective on achieving financial freedom and fulfillment. 'Why Do You Hate Money?' is a must-read for anyone seeking to overcome limiting beliefs and build a healthier relationship with their finances.",
    "totalPages": 192,
    "rating": 4.2,
    "category": "Finance",
    "tags": ["Money Management", "Financial Psychology"],
    "publisher": "Wealth Insights",
    "yearOfPublishing": 2020
  },
  {
    "bookId": "3",
    "bookName": "The Hate U Give",
    "author": "Angie Thomas",
    "image": "https://i.ibb.co/YZhR9YX/Book3.png",
    "review": "A powerful novel shedding light on police brutality and racial injustice. Thomas's gripping narrative explores themes of identity, activism, and systemic racism with raw honesty. Through the eyes of protagonist Starr Carter, readers are confronted with the harsh realities of prejudice and inequality. 'The Hate U Give' is not just a compelling story; it's a call to action for social change. This book is essential reading for anyone interested in understanding the complexities of race relations in America.",
    "totalPages": 464,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Social Justice", "Young Adult"],
    "publisher": "Balzer + Bray",
    "yearOfPublishing": 2017
  },
  {
    "bookId": "4",
    "bookName": "The Scholarship Monthly Planner",
    "author": "Sarah Johnson",
    "image": "https://i.ibb.co/RN8p9HV/Book4.png",
    "review": "A comprehensive planner to help students organize their scholarship applications effectively. Johnson's practical guide offers valuable tips and resources for navigating the scholarship process. With user-friendly templates and step-by-step instructions, this planner simplifies the daunting task of securing financial aid. Whether you're a high school student or a returning adult learner, 'The Scholarship Monthly Planner' is an indispensable tool for achieving your educational goals.",
    "totalPages": 150,
    "rating": 4.6,
    "category": "Education",
    "tags": ["Scholarships", "Study Planning"],
    "publisher": "Academic Solutions",
    "yearOfPublishing": 2021
  },
  {
    "bookId": "5",
    "bookName": "Annotated Texas Family Code",
    "author": "John Smith",
    "image": "https://i.ibb.co/g96W8G4/Book5.png",
    "review": "A detailed reference guide for legal professionals and students studying Texas family law. Smith's meticulous annotations provide clarity on complex legal issues, making this book an invaluable resource for practitioners and academics alike. From marriage and divorce to child custody and adoption, 'Annotated Texas Family Code' covers a wide range of topics with thoroughness and accuracy. Whether you're preparing for a case or conducting legal research, this comprehensive guide is an essential addition to any legal library.",
    "totalPages": 400,
    "rating": 4.4,
    "category": "Law",
    "tags": ["Legal Reference", "Texas Law"],
    "publisher": "Legal Publications Inc.",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "6",
    "bookName": "Loving Jesus More",
    "author": "Phillip Holmes",
    "image": "https://i.ibb.co/DbYTgfK/Book6.png",
    "review": "A heartfelt exploration of deepening one's relationship with Jesus Christ. Holmes's spiritual journey offers insight and inspiration for Christians seeking to strengthen their faith. Through personal anecdotes and biblical teachings, 'Loving Jesus More' encourages readers to cultivate a deeper intimacy with God. Whether you're a new believer or a seasoned Christian, this book offers practical guidance for growing closer to Christ and experiencing His love in tangible ways.",
    "totalPages": 180,
    "rating": 4.7,
    "category": "Religion",
    "tags": ["Christian Living", "Faith", "Spirituality"],
    "publisher": "FaithWorks",
    "yearOfPublishing": 2022
  },
  {
    "bookId": "7",
    "bookName": "The Lost Art of Good Conversation",
    "author": "Sakyong Mipham",
    "image": "https://i.ibb.co/8dKg73p/Book7.png",
    "review": "A guide to fostering meaningful connections through the art of conversation. Mipham's insightful book explores the importance of authentic communication in an age of digital distraction. With practical tips and engaging anecdotes, 'The Lost Art of Good Conversation' empowers readers to cultivate deeper connections with others. Whether you're networking professionally or building relationships personally, this book offers valuable insights for improving your conversational skills and enriching your social interactions.",
    "totalPages": 256,
    "rating": 4.3,
    "category": "Communication",
    "tags": ["Social Skills", "Communication"],
    "publisher": "Shambhala",
    "yearOfPublishing": 2017
  },
  {
    "bookId": "8",
    "bookName": "Cold-Case Christianity",
    "author": "J. Warner Wallace",
    "image": "https://i.ibb.co/6Zpy3vz/Book8.png",
    "review": "An intriguing examination of the reliability of the New Testament and the evidence for Christianity. Wallace's investigative approach to faith offers a compelling case for the truth of Christianity. Drawing on his experience as a cold-case detective, Wallace applies forensic principles to the study of scripture, uncovering compelling evidence for its reliability. 'Cold-Case Christianity' is a thought-provoking read for skeptics and believers alike, challenging readers to reexamine their assumptions about the Christian faith.",
    "totalPages": 320,
    "rating": 4.9,
    "category": "Religion",
    "tags": ["Christian Apologetics", "Biblical Studies"],
    "publisher": "David C. Cook",
    "yearOfPublishing": 2013
  },
  {
    "bookId": "9",
    "bookName": "Spine of the Dragon",
    "author": "Kevin J. Anderson",
    "image": "https://i.ibb.co/gwKRvSC/Book9.png",
    "review": "A gripping fantasy epic filled with intrigue, dragons, and political machinations. Anderson's richly imagined world immerses readers in a tale of adventure and betrayal. From the majestic dragons to the cunning political players, 'Spine of the Dragon' captivates with its vivid imagery and dynamic characters. As tensions escalate and alliances shift, readers are kept on the edge of their seats, eagerly turning pages to uncover the fate of the realm. Whether you're a seasoned fantasy fan or new to the genre, this epic tale will leave you eagerly anticipating the next installment.",
    "totalPages": 512,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": ["Epic Fantasy", "Political Intrigue"],
    "publisher": "Tor Books",
    "yearOfPublishing": 2019
  }
]
